tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Access VS Code through the browser
brew "code-server"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Lint your Python code for style and logical errors
brew "flake8"
# GitHub command-line tool
brew "gh"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Platform built on V8 to build network applications
brew "node", link: false
# Open source hot backup tool for InnoDB and XtraDB databases
brew "percona-xtrabackup"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool Command Language
brew "tcl-tk"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# JavaScript package manager
brew "yarn"
# Terraform
brew "hashicorp/tap/terraform"
# Universal database tool and SQL client
brew 'mas' # Mac App Store manager
cask "dbeaver-community"
# Cloud credentials manager
cask "leapp"
# Team communication and collaboration software
cask "slack"
cask 'visual-studio-code'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'brave-browser'
cask 'zoom'
cask 'cursor'
cask 'whatsapp'
cask 'postman'

vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "redhat.java"
vscode "rvest.vs-code-prettier-eslint"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
